# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

num = [1, 1, 2, 2, 3, 3, 4, 5, 6, 7, 8, 9]
print(set(num))
